Repository: CamilaBodack/python-docs-pt-br
Catalog: tutorial/interactive.po
Languages: pt_br

source: Interactive Input Editing and History Substitution
pt_br: Edição de entrada interativa e substituição de histórico

source: Some versions of the Python interpreter support editing of the current input line and history substitution, similar to facilities found in the Korn shell and the GNU Bash shell. This is implemented using the `GNU Readline`_ library, which supports Emacs-style and vi-style editing. This library has its own documentation which I won't duplicate here; however, the basics are easily explained. The interactive editing and history described here are optionally available in the Unix and Cygwin versions of the interpreter.
pt_br: Algumas versões do interpretador Python suportam facilidades de edição e substituição semelhantes às encontradas na shell Korn ou na GNU Bash. Isso é implementado através da biblioteca `GNU Readline`_, que suporta edição no estilo Emacs ou vi. Essa biblioteca possui sua própria documentação, que não será duplicada aqui. Porém os fundamentos são fáceis de serem explicados. As facilidades aqui descritas estão disponíveis nas versões Unix e Cygwin do interpretador.

source: This chapter does *not* document the editing facilities of Mark Hammond's PythonWin package or the Tk-based environment, IDLE, distributed with Python. The command line history recall which operates within DOS boxes on NT and some other DOS and Windows flavors is yet another beast.
pt_br: Este capítulo *não* documenta as facilidades de edição do pacote PythonWin de Mark Hammond, ou do ambiente IDLE baseado em Tk e distribuído junto com Python. A recuperação de histórico da linha de comando do DOS ou NT e outros sabores de DOS e Windows também são bichos diferentes.

source: Line Editing
pt_br: Edição de linha

source: If supported, input line editing is active whenever the interpreter prints a primary or secondary prompt. The current line can be edited using the conventional Emacs control characters. The most important of these are: :kbd:`C-A` (Control-A) moves the cursor to the beginning of the line, :kbd:`C-E` to the end, :kbd:`C-B` moves it one position to the left, :kbd:`C-F` to the right. Backspace erases the character to the left of the cursor, :kbd:`C-D` the character to its right. :kbd:`C-K` kills (erases) the rest of the line to the right of the cursor, :kbd:`C-Y` yanks back the last killed string. :kbd:`C-underscore` undoes the last change you made; it can be repeated for cumulative effect.
pt_br: Se instalada, a edição de linha está ativa sempre que o interpretador exibir um dos prompts (primário ou secundário). A linha atual pode ser editada usando comandos típicos do Emacs. Os mais importantes são: :kbd:`C-A` (Control-A) move o cursor para o início da linha, :kbd:`C-E` para o fim, :kbd:`C-B` move uma posição para à esquerda, :kbd:`C-F` para a direita. :kbd:`Backspace` apaga o caractere à esquerda, :kbd:`C-D` apaga o da direita. :kbd:`C-K` apaga do cursor até o resto da linha à direita, :kbd:`C-Y` cola a linha apagada. :kbd:`C-underscore` desfaz a última alteração que você fez; e pode ser repetido com efeito cumulativo.

source: History Substitution
pt_br: Substituição por histórico

source: History substitution works as follows. All non-empty input lines issued are saved in a history buffer, and when a new prompt is given you are positioned on a new line at the bottom of this buffer. :kbd:`C-P` moves one line up (back) in the history buffer, :kbd:`C-N` moves one down. Any line in the history buffer can be edited; an asterisk appears in front of the prompt to mark a line as modified. Pressing the :kbd:`Return` key passes the current line to the interpreter. :kbd:`C-R` starts an incremental reverse search; :kbd:`C-S` starts a forward search.
pt_br: Funciona da seguinte maneira: todas linhas não vazias são armazenadas em um buffer de histórico, e ao digitar uma nova linha no prompt você está editando a última linha deste buffer. :kbd:`C-P` retrocede uma linha no histórico, :kbd:`C-N` avança uma linha. Qualquer linha desse histórico pode ser editada; quando você faz isso, um astesrico aparece na frente do prompt. Pressionando :kbd:`Enter` a linha atual é enviada para o interpretador. :kbd:`C-R` inicia uma busca para trás no histórico, e :kbd:`C-S` faz uma busca para frente. [#]_

source: Key Bindings
pt_br: Definição de atalhos

source: The key bindings and some other parameters of the Readline library can be customized by placing commands in an initialization file called :file:`~/.inputrc`. Key bindings have the form ::
pt_br: Atalhos de teclado e outros parâmetros da biblioteca Readline podem ser personalizados colocando configurações no arquivo :file:`~/.inputrc`. A definição de atalhos tem o formato ::

source: or ::
pt_br: ou ::

source: and options can be set with ::
pt_br: e opções podem ser especificadas com ::

source: For example::
pt_br: Por exemplo::

source: Note that the default binding for :kbd:`Tab` in Python is to insert a :kbd:`Tab` character instead of Readline's default filename completion function. If you insist, you can override this by putting ::
pt_br: Observe que a definição padrão para :kbd:`Tab` em Python é inserir um caractere :kbd:`Tab` ao invés de completar o nome de um arquivo (padrão no Readline). Isto pode ser reconfigurado de volta colocando:

source: in your :file:`~/.inputrc`. (Of course, this makes it harder to type indented continuation lines if you're accustomed to using :kbd:`Tab` for that purpose.)
pt_br: em seu :file:`~/.inputrc`. Todavia, isto torna mais difícil digitar comandos indentados em linhas de continuação se você estiver acostumado a usar :kbd:`Tab` para isso.

source: Automatic completion of variable and module names is optionally available. To enable it in the interpreter's interactive mode, add the following to your startup file: [#]_ ::
pt_br: O preenchimento automático de nomes de variáveis e módulos estão opcionalmente disponíveis. Para habilitá-los no modo interativo, adicione o seguinte ao seu arquivo de inicialização: [#]_ ::

source: This binds the :kbd:`Tab` key to the completion function, so hitting the :kbd:`Tab` key twice suggests completions; it looks at Python statement names, the current local variables, and the available module names. For dotted expressions such as ``string.a``, it will evaluate the expression up to the final ``'.'`` and then suggest completions from the attributes of the resulting object. Note that this may execute application-defined code if an object with a :meth:`__getattr__` method is part of the expression.
pt_br: Isso vincula a tecla :kbd:`Tab` para o preenchimento automático de nomes de função. Assim, teclar :kbd:`Tab` duas vezes dispara o preenchimento, procurando um determinado nome entre as variáveis locais e módulos disponíveis. Para expressões terminadas em ponto, como em ``string.a``, a expressão será avaliada até o último ``'.'`` quando serão sugeridos possíveis complementos. Note que isso pode executar código da sua aplicação quando um objeto que define o método :meth:`__getattr__` fizer parte da expressão.

source: A more capable startup file might look like this example. Note that this deletes the names it creates once they are no longer needed; this is done since the startup file is executed in the same namespace as the interactive commands, and removing the names avoids creating side effects in the interactive environment. You may find it convenient to keep some of the imported modules, such as :mod:`os`, which turn out to be needed in most sessions with the interpreter. ::
pt_br: Um arquivo de inicialização mais completo seria algo como esse exemplo. Note que ele deleta os nomes que cria quando não são mais necessários; isso é feito porque o arquivo de inicialização é executado no mesmo ambiente dos comandos interativos, e remover os nomes evita criar efeitos colaterais no ambiente interativo. Você pode achar conveniente manter alguns dos módulos importados, como :mod:`os`, que acaba sendo necessário na maior parte das sessões com o interpretador. ::

source: Alternatives to the Interactive Interpreter
pt_br: Alternativas ao interpretador interativo

source: This facility is an enormous step forward compared to earlier versions of the interpreter; however, some wishes are left: It would be nice if the proper indentation were suggested on continuation lines (the parser knows if an indent token is required next). The completion mechanism might use the interpreter's symbol table. A command to check (or even suggest) matching parentheses, quotes, etc., would also be useful.
pt_br: Esta facilidade é um enorme passo em frente em comparação com as versões anteriores do intérpretador; No entanto, alguns desejos são deixados: seria bom se a indentação adequada fosse sugerida nas linhas de continuação (o analisador sabe se é necessário um token de recuo). O mecanismo de conclusão pode usar a tabela de símbolos do intérprete. Um comando para verificar (ou mesmo sugerir) parênteses, citações, etc., também seria útil.

source: One alternative enhanced interactive interpreter that has been around for quite some time is IPython_, which features tab completion, object exploration and advanced history management. It can also be thoroughly customized and embedded into other applications. Another similar enhanced interactive environment is bpython_.
pt_br: Um intérprete interativo aprimorado e alternativo que existe há algum tempo é o IPython_, que apresenta a conclusão da guia, a exploração de objetos e o gerenciamento de histórico avançado. Também pode ser completamente personalizado e incorporado em outras aplicações. Outro ambiente interativo aprimorado similar é bpython_.

source: Footnotes
pt_br: Notas de Rodapé

source: Python will execute the contents of a file identified by the :envvar:`PYTHONSTARTUP` environment variable when you start an interactive interpreter. To customize Python even for non-interactive mode, see :ref:`tut-customize`.
pt_br: [#] Python executará o conteúdo do arquivo identificado pela variável de ambiente :envvar:`PYTHONSTARTUP` quando se inicia o interpretador no modo interativo. Para personalizar Python no modo não-interativo, veja :ref:`tut-customize`.
